Repository: MohanadSamara/clinic_app
Catalog: lib/l10n/app_*.arb
Languages: ar

source: Amman, Jordan
ar: عمان، الأردن

# phonePlaceholder
source: Phone: +962 XX XXX XXXX
ar: الهاتف: +962 XX XXX XXXX

# emailPlaceholder
source: Email: info@vetcare.jo
ar: البريد الإلكتروني: info@vetcare.jo

# invoiceNumber
source: Invoice #
ar: رقم الفاتورة

source: Date
ar: التاريخ

source: Customer Information
ar: معلومات العميل

# phoneLabel
source: Phone
ar: الهاتف

# emailLabel
source: Email
ar: البريد الإلكتروني

source: Subtotal
ar: المجموع الفرعي

# tax
source: Tax (16%)
ar: الضريبة (16%)

source: Transaction ID
ar: معرف المعاملة

source: Completed
ar: مكتمل

# noAvailableVans
source: No available vans to assign. Please create vans first.
ar: لا توجد فانات متاحة للتعيين. يرجى إنشاء فانات أولاً.

# welcomeMessage
source: Welcome to Vet2U
ar: مرحباً بك في فيت تو يو

# languageToggle
source: Language
ar: اللغة

source: Pet
ar: حيوان أليف

source: Medical Record
ar: سجل طبي

source: Upload Document
ar: رفع المستند

source: Select File
ar: اختر ملف

source: Access Level
ar: مستوى الوصول

source: Private
ar: خاص

source: Public
ar: عام

source: Restricted
ar: محدود

source: Upload
ar: رفع

source: Uploading...
ar: جارٍ الرفع...

source: Document uploaded successfully
ar: تم رفع المستند بنجاح

source: Failed to upload document
ar: فشل في رفع المستند

source: Confirm Password
ar: تأكيد كلمة المرور

source: Current Password
ar: كلمة المرور الحالية

source: New Password
ar: كلمة المرور الجديدة

source: Specialization
ar: التخصص

source: License Number
ar: رقم الرخصة

source: Years of Experience
ar: سنوات الخبرة

source: Professional Bio
ar: السيرة المهنية

# enablePasswordChange
source: Enable to change your password
ar: تفعيل لتغيير كلمة المرور

# profileInfoHelp
source: Your profile information helps us contact you and secure your account.
ar: تساعدنا معلومات ملفك الشخصي في الاتصال بك وتأمين حسابك.

# tapToSelectFile
source: Tap to select a file
ar: اضغط لاختيار ملف

# supportedFormats
source: Supported: PDF, JPG, PNG, DOC, DOCX, TXT (Max 10MB)
ar: مدعوم: PDF، JPG، PNG، DOC، DOCX، TXT (الحد الأقصى 10 ميجابايت)

# linkToMedicalRecord
source: Link to Medical Record (Optional)
ar: ربط بسجل طبي (اختياري)

# associateWithRecord
source: Associate this document with a specific medical record
ar: ربط هذا المستند بسجل طبي محدد

source: No specific record
ar: لا يوجد سجل محدد

# accessLevelDescription
source: Private: Only pet owner and uploader Public: Anyone can view Restricted: Only doctors and admins
ar: خاص: مالك الحيوان الأليف ومرر الرفع فقط عام: يمكن لأي شخص العرض محدود: الأطباء والمديرون فقط

# pleaseSelectFile
source: Please select a file
ar: يرجى اختيار ملف

source: Error picking file
ar: خطأ في اختيار الملف

source: Error uploading document
ar: خطأ في رفع المستند

# phoneRequired
source: Phone number is required for doctors
ar: رقم الهاتف مطلوب للأطباء

# specializationRequired
source: Specialization is required
ar: التخصص مطلوب

# licenseRequired
source: License number is required
ar: رقم الرخصة مطلوب

# experienceRequired
source: Years of experience is required
ar: سنوات الخبرة مطلوبة

# areaRequired
source: Service area is required
ar: منطقة الخدمة مطلوبة

# bioRequired
source: Professional bio is required
ar: السيرة المهنية مطلوبة

source: Passwords do not match
ar: كلمات المرور غير متطابقة

# invalidPhoneNumber
source: Please enter a valid phone number
ar: يرجى إدخال رقم هاتف صحيح

# invalidExperience
source: Please enter a valid number of years
ar: يرجى إدخال عدد سنوات صحيح

# experienceTooHigh
source: Please enter a realistic number of years
ar: يرجى إدخال عدد سنوات واقعي

# nameMinLength
source: Name must be at least 2 characters
ar: يجب أن يكون الاسم حرفين على الأقل

# bioMinLength
source: Bio must be at least 10 characters
ar: يجب أن تكون السيرة المهنية 10 أحرف على الأقل

# welcomeBackUser
source: Welcome back, {name}!
ar: مرحباً بعودتك، {name}!

# trustedPartnerPetCare
source: Your trusted partner in pet care
ar: شريكك الموثوق في رعاية الحيوانات الأليفة

# compassionateVeterinaryCare
source: Providing compassionate veterinary care with professional expertise. Our mobile clinic brings quality healthcare to your doorstep for the comfort and convenience of your beloved pets.
ar: تقديم رعاية بيطرية رحيمة مع خبرة مهنية. يجلب عيادتنا المتنقلة الرعاية الصحية عالية الجودة إلى باب منزلك لراحة وأريحية حيواناتك الأليفة المحبوبة.

# happyPets
source: 1000+ Happy Pets
ar: 1000+ حيوان أليف سعيد

source: Success Stories
ar: قصص النجاح

source: VetCare Clinic
ar: عيادة فيت كير

source: Bill To
ar: فاتورة إلى

# thankYouVetCare
source: Thank you for choosing VetCare Clinic!
ar: شكراً لاختيارك عيادة فيت كير!

# questionsContactSupport
source: For any questions regarding this invoice, please contact our support team.
ar: لأي أسئلة بخصوص هذه الفاتورة، يرجى الاتصال بفريق الدعم لدينا.

source: Selected Address:
ar: العنوان المحدد:

source: Enter Address Manually:
ar: أدخل العنوان يدوياً:

source: Enter address for this location
ar: أدخل عنوان لهذا الموقع

source: No email
ar: لا يوجد بريد إلكتروني

# savedMyCatEmergency
source: saved my cat's life during an emergency. Professional service and quick response!
ar: أنقذ حياة قطتي أثناء الطوارئ. خدمة مهنية واستجابة سريعة!

source: Happy Pet Owner
ar: مالك حيوان أليف سعيد

# mobileVetServiceAmazing
source: The mobile vet service is amazing! My dog was so comfortable at home. Highly recommend!
ar: خدمة الطبيب البيطري المتنقلة مذهلة! كان كلبي مرتاحاً جداً في المنزل. أنصح بها بشدة!

source: Dog Lover
ar: عاشق الكلاب

# affordableProfessionalCaring
source: Affordable, professional, and caring. Vet2U is now my go-to for all my pet's needs.
ar: معقولة، مهنية، ومهتمة. فيت تو يو أصبح خياري الأول لجميع احتياجات حيواني الأليف.

source: Pet Parent
ar: والد حيوان أليف

# scheduleAppointmentForPets
source: Schedule an appointment for your pets
ar: جدولة موعد لحيواناتك الأليفة

# registerPetsToStartBooking
source: Register your pets to start booking visits.
ar: سجل حيواناتك الأليفة لبدء الحجز.

source: Schedule appointments
ar: جدولة المواعيد

source: Documents
ar: المستندات

source: Download files
ar: تحميل الملفات

source: Urgent care
ar: رعاية عاجلة

source: Manage Pets
ar: إدارة الحيوانات الأليفة

source: View Appointments
ar: عرض المواعيد

# doctorNamePrefix
source: Dr.
ar: د.

# locationError
source: Error: {error}
ar: خطأ: {error}

# coordinatesFormat
source: Lat: {lat}, Lng: {lng}
ar: خط العرض: {lat}، خط الطول: {lng}

# locationNotCaptured
source: Location not captured yet
ar: لم يتم التقاط الموقع بعد

# availableTeamsCount
source: {count} teams available for home visits
ar: {count} فريق متاح للزيارات المنزلية

source: Coordinates
ar: الإحداثيات

# doctorNameWithText
source: Dr. {name}
ar: د. {name}

# linkedWithDoctor
source: Successfully linked with Dr. {doctorName}
ar: تم الربط بنجاح مع د. {doctorName}

# vanAssignedTo
source: Van "{vanName}" assigned to Dr. {doctorName} and {driverName}
ar: تم تخصيص الفان "{vanName}" للدكتور {doctorName} والسائق {driverName}

# teamDoctorDriver
source: Team: Dr. {doctorName} & {driverName}
ar: الفريق: د. {doctorName} و {driverName}

# doctorAndDriverLinked
source: Dr. {doctorName} and {driverName} have been linked. You must assign them to a van to complete the process.
ar: تم ربط د. {doctorName} و {driverName}. يجب عليك تخصيص فان لهم لإكمال العملية.

# successfullyLinkedDoctor
source: Successfully linked Dr. {doctorName} to {driverName} and assigned van "{vanName}"
ar: تم ربط د. {doctorName} بـ {driverName} بنجاح وتخصيص الفان "{vanName}"

# linkedDoctorToDriver
source: Linked Dr. {doctorName} to driver {driverName}
ar: ربط د. {doctorName} بالسائق {driverName}

# unlinkedDoctorFromDriver
source: Unlinked Dr. {doctorName} from driver {driverName}
ar: تم إلغاء ربط د. {doctorName} من السائق {driverName}

source: Available
ar: متاح

source: Offline
ar: غير متصل

# confirmDeleteMedicalRecord
source: Are you sure you want to delete this medical record? This action cannot be undone.
ar: هل أنت متأكد من أنك تريد حذف هذا السجل الطبي؟ لا يمكن التراجع عن هذا الإجراء.

source: Not set
ar: غير محدد

source: Alert preferences
ar: تفضيلات التنبيهات

source: Notification settings coming soon
ar: إعدادات الإشعارات قادمة قريباً

source: Linked Driver
ar: السائق المرتبط

source: ACTIVE
ar: نشط

source: Today's Appointments
ar: مواعيد اليوم

source: Manage Appointments
ar: إدارة المواعيد

source: View and update patient schedules
ar: عرض وتحديث جداول المرضى

source: Record Treatments
ar: تسجيل العلاجات

source: Document medical procedures
ar: توثيق الإجراءات الطبية

source: Inventory Management
ar: إدارة المخزون

source: Check supplies and medications
ar: فحص المستلزمات والأدوية

source: Medical Records
ar: السجلات الطبية

source: View and manage patient records
ar: عرض وإدارة سجلات المرضى

source: Upload Documents
ar: رفع المستندات

source: Upload treatment documents and reports
ar: رفع مستندات وتقارير العلاج

source: Urgent Cases
ar: الحالات العاجلة

source: Approve and manage urgent service requests
ar: الموافقة على طلبات الخدمة العاجلة وإدارتها

# medicalRecordsScreen
source: Medical Records
ar: السجلات الطبية

source: Add Medical Record
ar: إضافة سجل طبي

source: Add medical records for your patients
ar: إضافة سجلات طبية لمرضاك

source: Add First Record
ar: إضافة السجل الأول

source: Medical record deleted successfully
ar: تم حذف السجل الطبي بنجاح

source: Update your credentials
ar: تحديث بيانات اعتمادك

source: Schedule Settings
ar: إعدادات الجدول

source: Working hours and availability
ar: ساعات العمل والتوفر

source: Additional Notes
ar: ملاحظات إضافية

source: Van updated successfully
ar: تم تحديث الفان بنجاح

source: Van added successfully
ar: تم إضافة الفان بنجاح

source: Error saving van
ar: خطأ في حفظ الفان

source: Delete Van
ar: حذف الفان

# areYouSureYouWantToDeleteVan
source: Are you sure you want to delete "{vanName}"? This action cannot be undone.
ar: هل أنت متأكد من أنك تريد حذف "{vanName}"? هذا الإجراء لا يمكن التراجع عنه.

source: Van deleted successfully
ar: تم حذف الفان بنجاح

# errorDeletingVan
source: Error deleting van: {error}
ar: خطأ في حذف الفان: {error}

# vanAssignedToTeam
source: Van "{vanName}" assigned to Dr. {doctorName} and {driverName}
ar: تم تخصيص الفان "{vanName}" للدكتور {doctorName} والسائق {driverName}

# errorUnassigningVan
source: Error unassigning van: {error}
ar: خطأ في إلغاء تخصيص الفان: {error}

source: You do not have permission to access this page.
ar: ليس لديك صلاحية للوصول إلى هذه الصفحة.

source: Van Management
ar: إدارة الفانات

source: Edit Van
ar: تحرير الفان

source: Add New Van
ar: إضافة فان جديد

source: Van Name
ar: اسم الفان

# vanNameRequired
source: Van name is required
ar: اسم الفان مطلوب

source: License Plate
ar: لوحة الترخيص

# licensePlateRequired
source: License plate is required
ar: لوحة الترخيص مطلوبة

# capacityRequired
source: Capacity is required
ar: السعة مطلوبة

source: Enter valid capacity
ar: أدخل سعة صحيحة

source: Optional description
ar: وصف اختياري

source: Area
ar: المنطقة

source: Select an area
ar: اختر منطقة

source: Update Van
ar: تحديث الفان

source: Add Van
ar: إضافة فان

source: No vans found
ar: لم يتم العثور على فانات

source: Fully Assigned
ar: مخصص بالكامل

source: Partially Assigned
ar: مخصص جزئياً

source: Assign to Team
ar: تخصيص للفريق

source: Unassign Van
ar: إلغاء تخصيص الفان

# vanNameExample
source: e.g., Vet Van Alpha
ar: مثال: فان بيطري ألفا

# licensePlateExample
source: e.g., VET-001
ar: مثال: VET-001

# modelExample
source: e.g., Ford Transit
ar: مثال: فورد ترانزيت

source: Number of passengers
ar: عدد الركاب

source: Are you sure you want to close the app?
ar: هل أنت متأكد من أنك تريد إغلاق التطبيق؟

source: Please close this browser tab manually to exit the app
ar: يرجى إغلاق علامة التبويب هذه يدوياً للخروج من التطبيق

source: Please close the application window manually to exit
ar: يرجى إغلاق نافذة التطبيق يدوياً للخروج

source: Vet2U Driver
ar: فيت تو يو - السائق

source: Online
ar: متصل

source: Your Location
ar: موقعك

source: Getting location...
ar: جارٍ الحصول على الموقع...

source: Live Map
ar: الخريطة المباشرة

source: You
ar: أنت

source: Next Stop
ar: المحطة التالية

source: Other Stops
ar: المحطات الأخرى

source: Driver Status
ar: حالة السائق

source: Status updates automatically
ar: تحديث الحالة تلقائياً

source: Next Appointment
ar: الموعد التالي

source: Address not available
ar: العنوان غير متوفر

source: Scheduled
ar: مجدول

source: Navigate
ar: التنقل

source: No Appointments Available
ar: لا توجد مواعيد متاحة

source: Link with a Doctor
ar: ربط بطبيب

source: All Appointments
ar: جميع المواعيد

source: Vehicle Check
ar: فحص المركبة

source: OK
ar: موافق

source: Current location not available
ar: الموقع الحالي غير متوفر

# couldNotOpenMaps
source: Could not open maps: {error}
ar: تعذر فتح الخرائط: {error}

source: Appointment Details
ar: تفاصيل الموعد

source: Not specified
ar: غير محدد

# noPermissionToAccessPage
source: You do not have permission to access this page.
ar: ليس لديك صلاحية للوصول إلى هذه الصفحة.

source: Welcome, {name}
ar: مرحباً، {name}

source: Admin Functions
ar: وظائف المدير

source: User Management
ar: إدارة المستخدمين

source: Service Management
ar: إدارة الخدمات

source: Reporting & Analytics
ar: التقارير والتحليلات

source: Compliance & Records
ar: الامتثال والسجلات

source: Data Backup & Restore
ar: نسخ احتياطي واستعادة البيانات

source: Area Management
ar: إدارة المناطق

source: System Settings
ar: إعدادات النظام

source: Audit Logs
ar: سجلات التدقيق

source: Data exported to clipboard
ar: تم تصدير البيانات إلى الحافظة

# exportFailed
source: Export failed: {error}
ar: فشل التصدير: {error}

source: Import Data
ar: استيراد البيانات

source: Paste the exported JSON data below:
ar: الصق بيانات JSON المصدرة أدناه:

source: Import
ar: استيراد

source: Data imported successfully
ar: تم استيراد البيانات بنجاح

# importFailed
source: Import failed: {error}
ar: فشل الاستيراد: {error}

source: Add Service
ar: إضافة خدمة

source: Service name is required
ar: اسم الخدمة مطلوب

source: Valid price is required
ar: سعر صحيح مطلوب

source: Category is required
ar: الفئة مطلوبة

source: Service added
ar: تم إضافة الخدمة

# errorAddingService
source: Error adding service: {error}
ar: خطأ في إضافة الخدمة: {error}

source: Edit Service
ar: تحرير الخدمة

source: Service updated
ar: تم تحديث الخدمة

# errorUpdatingService
source: Error updating service: {error}
ar: خطأ في تحديث الخدمة: {error}

source: Delete Service
ar: حذف الخدمة

# areYouSureYouWantToDeleteService
source: Are you sure you want to delete "{serviceName}"?
ar: هل أنت متأكد من أنك تريد حذف "{serviceName}"?

# serviceDeleted
source: has been deleted
ar: تم الحذف

# errorDeletingService
source: Error deleting service: {error}
ar: خطأ في حذف الخدمة: {error}

source: No services found
ar: لم يتم العثور على خدمات

source: Vehicle check functionality will be implemented here.
ar: سيتم تنفيذ وظيفة فحص المركبة هنا.

source: Support contact functionality will be implemented
ar: سيتم تنفيذ وظيفة الاتصال بالدعم

# successfullyLinkedWithDoctor
source: Successfully linked with Dr. {doctorName}
ar: تم الربط بنجاح مع د. {doctorName}

source: Failed to link with doctor
ar: فشل في الربط مع الطبيب

source: Select
ar: اختر

source: Add User
ar: إضافة مستخدم

# errorAddingUser
source: Error adding user: {error}
ar: خطأ في إضافة المستخدم: {error}

source: Set as Owner
ar: تعيين كمالك

source: Set as Doctor
ar: تعيين كطبيب

source: Set as Driver
ar: تعيين كسائق

source: Set as Admin
ar: تعيين كمدير

source: Link to Driver
ar: ربط بالسائق

source: Unlink from Driver
ar: إلغاء الربط من السائق

source: File saved to Documents folder
ar: تم حفظ الملف في مجلد المستندات

source: Appointment Management
ar: إدارة المواعيد

source: Appointment accepted
ar: تم قبول الموعد

source: Appointment started
ar: تم بدء الموعد

source: Reschedule feature coming soon
ar: ميزة إعادة الجدولة قادمة قريباً

source: Appointment rejected
ar: تم رفض الموعد

source: Location updated successfully
ar: تم تحديث الموقع بنجاح

source: Failed to update location
ar: فشل في تحديث الموقع

source: Payment processing failed
ar: فشل في معالجة الدفع

source: Appointment completed and treatment record saved
ar: تم إكمال الموعد وحفظ سجل العلاج

source: Payment marked as received
ar: تم وضع علامة على الدفع كمستلم

source: Failed to process payment
ar: فشل في معالجة الدفع

# completeAppointmentAndRecordTreatment
source: Complete Appointment & Record Treatment
ar: إكمال الموعد وتسجيل العلاج

# completeAndSave
source: Complete & Save
ar: إكمال وحفظ

source: Please fill in diagnosis and treatment
ar: يرجى ملء التشخيص والعلاج

source: Set Location
ar: تعيين الموقع

source: Accept
ar: قبول

source: Reschedule
ar: إعادة جدولة

source: Reject
ar: رفض

source: Start Appointment
ar: بدء الموعد

source: Mark Payment Received
ar: وضع علامة على الدفع كمستلم

source: Mark Complete
ar: وضع علامة كمكتمل

source: Settings saved successfully
ar: تم حفظ الإعدادات بنجاح

source: Failed to save some settings
ar: فشل في حفظ بعض الإعدادات

source: Save All Settings
ar: حفظ جميع الإعدادات

source: Daily
ar: يومي

source: Weekly
ar: أسبوعي

source: Monthly
ar: شهري

source: Dog
ar: كلب

source: Cat
ar: قطة

source: Bird
ar: طائر

source: Rabbit
ar: أرنب

source: Hamster
ar: هامستر

source: Fish
ar: سمكة

source: Other
ar: أخرى

source: Emergency case approved successfully
ar: تمت الموافقة على حالة الطوارئ بنجاح

source: Failed to approve case
ar: فشل في الموافقة على الحالة

source: Emergency case rejected
ar: تم رفض حالة الطوارئ

source: Failed to reject case
ar: فشل في رفض الحالة

source: Reject Emergency Case
ar: رفض حالة الطوارئ

source: Add First Item
ar: إضافة العنصر الأول

source: No categories available
ar: لا توجد فئات متاحة

source: Delete Item
ar: حذف العنصر

# areYouSureYouWantToDeleteItem
source: Are you sure you want to delete {itemName}?
ar: هل أنت متأكد من أنك تريد حذف {itemName}؟

# itemDeleted
source: {itemName} deleted
ar: تم حذف {itemName}

# stock
source: Update Stock
ar: تحديث المخزون

source: Stock updated successfully
ar: تم تحديث المخزون بنجاح

source: Medical Record Details
ar: تفاصيل السجل الطبي

# previewFunctionalityFor
source: Preview functionality for {fileName}
ar: وظيفة المعاينة لـ {fileName}

source: Add Files
ar: إضافة ملفات

source: Size
ar: الحجم

source: Preview
ar: معاينة

source: Delete Document
ar: حذف الوثيقة

# areYouSureYouWantToDeleteDocument
source: Are you sure you want to delete this document?
ar: هل أنت متأكد من أنك تريد حذف هذه الوثيقة؟

source: Document deleted successfully
ar: تم حذف الوثيقة بنجاح

source: Failed to delete document
ar: فشل في حذف الوثيقة

# errorDeletingDocument
source: Error deleting document: {error}
ar: خطأ في حذف الوثيقة: {error}

source: Skip for Now
ar: تخطي الآن

source: Schedule updated successfully
ar: تم تحديث الجدول بنجاح

source: Failed to update schedule
ar: فشل في تحديث الجدول

source: Treatment Recording
ar: تسجيل العلاج

source: Pet selection will be implemented
ar: سيتم تنفيذ اختيار الحيوان الأليف

source: Emergency Case
ar: حالة طوارئ

source: Save Treatment Record
ar: حفظ سجل العلاج

source: No treatment records yet
ar: لا توجد سجلات علاج بعد

source: Please select a patient
ar: يرجى اختيار مريض

source: Treatment record saved successfully
ar: تم حفظ سجل العلاج بنجاح

source: Failed to save treatment record
ar: فشل في حفظ سجل العلاج

source: Treatment History
ar: تاريخ العلاج

source: No treatment records found
ar: لم يتم العثور على سجلات علاج

source: Share
ar: مشاركة

source: Info
ar: معلومات

source: Retry
ar: إعادة المحاولة

source: Download PDF
ar: تحميل PDF

source: Download File
ar: تحميل الملف

source: Share functionality coming soon
ar: ميزة المشاركة قادمة قريباً

source: Document Information
ar: معلومات الوثيقة

source: Doctor Dashboard Translation Test
ar: اختبار ترجمة لوحة تحكم الطبيب

source: All categories accessible
ar: جميع الفئات متاحة

source: Switch Language
ar: تبديل اللغة

source: Search doctors...
ar: البحث عن الأطباء...

source: Specialty
ar: التخصص

source: Distance unavailable
ar: المسافة غير متوفرة

source: Support
ar: الدعم

source: Delete Medical Record
ar: حذف السجل الطبي

# phoneRequiredForDoctors
source: Phone number is required for doctors
ar: رقم الهاتف مطلوب للأطباء

# enterValidPhoneNumber
source: Please enter a valid phone number
ar: يرجى إدخال رقم هاتف صحيح

# specializationHint
source: e.g., Veterinary Medicine, Surgery, etc.
ar: مثال: الطب البيطري، الجراحة، إلخ.

# licenseNumberHint
source: Professional license number
ar: رقم الرخصة المهنية

# yearsHint
source: Number of years
ar: عدد السنوات

# enterValidNumber
source: Please enter a valid number
ar: يرجى إدخال رقم صحيح

# enterRealisticYears
source: Please enter a realistic number of years
ar: يرجى إدخال عدد سنوات واقعي

# bioHint
source: Brief description of your experience and services
ar: وصف مختصر لخبراتك وخدماتك

# currentPasswordRequired
source: Current password is required
ar: كلمة المرور الحالية مطلوبة

# newPasswordRequired
source: New password is required
ar: كلمة المرور الجديدة مطلوبة

source: Confirm New Password
ar: تأكيد كلمة المرور الجديدة

# confirmPasswordRequired
source: Please confirm your new password
ar: يرجى تأكيد كلمة المرور الجديدة

source: Edit Medical Record
ar: تحرير السجل الطبي

# petLabel
source: Pet
ar: الحيوان الأليف

source: Visit Date
ar: تاريخ الزيارة

# diagnosisHint
source: Describe the diagnosis...
ar: وصف التشخيص...

# diagnosisRequired
source: Diagnosis *
ar: التشخيص *

# diagnosisDetailed
source: Please provide a detailed diagnosis
ar: يرجى تقديم تشخيص مفصل

# treatmentHint
source: Describe the treatment provided...
ar: وصف العلاج المقدم...

# treatmentRequired
source: Treatment is required
ar: العلاج مطلوب

# treatmentDetailed
source: Please provide detailed treatment information
ar: يرجى تقديم معلومات علاج مفصلة

source: Prescription (Optional)
ar: الوصفة (اختياري)

# prescriptionHint
source: List prescribed medications and dosages...
ar: قائمة الأدوية الموصوفة والجرعات...

source: Additional Notes (Optional)
ar: ملاحظات إضافية (اختياري)

# notesHint
source: Any additional observations or follow-up instructions...
ar: أي ملاحظات إضافية أو تعليمات متابعة...

# medicalRecordAdded
source: Medical record added successfully
ar: تم إضافة السجل الطبي بنجاح

# medicalRecordUpdated
source: Medical record updated successfully
ar: تم تحديث السجل الطبي بنجاح

source: Add Supporting Documents
ar: إضافة مستندات داعمة

# uploadDocumentsDescription
source: Upload medical documents, lab results, or images related to this record
ar: رفع مستندات طبية، نتائج مختبر، أو صور متعلقة بهذا السجل

source: Update Record
ar: تحديث السجل

source: Save Record
ar: حفظ السجل

source: Sorted by date & time
ar: مرتب حسب التاريخ والوقت

# appointmentsAutoSorted
source: Appointments are automatically sorted by date and time
ar: يتم ترتيب المواعيد تلقائياً حسب التاريخ والوقت

# locationUpdateFailed
source: Failed to update location
ar: فشل في تحديث الموقع

# appointmentServiceType
source: Appointment
ar: الموعد

# treatmentProvidedRequired
source: Treatment Provided *
ar: العلاج المقدم *

# prescriptionOptionalShort
source: Prescription (Optional)
ar: الوصفة (اختياري)

# paymentProcessingFailedGeneral
source: Failed to process payment
ar: فشل في معالجة الدفع

# scheduledAt
source: Scheduled
ar: مجدول

# locationLabel
source: Location
ar: الموقع

# descriptionLabel
source: Description
ar: الوصف

source: Upload Files
ar: رفع الملفات

# rescheduleComingSoon
source: Reschedule feature coming soon
ar: ميزة إعادة الجدولة قادمة قريباً

# locationUpdated
source: Location updated successfully
ar: تم تحديث الموقع بنجاح

# appointmentCompletedRecordSaved
source: Appointment completed and treatment record saved
ar: تم إكمال الموعد وحفظ سجل العلاج

# appointmentCompletedRecordFailed
source: Failed to save treatment record
ar: فشل في حفظ سجل العلاج
