Repository: MohanadSamara/clinic_app
Catalog: lib/l10n/app_*.arb
Languages: ar

# appTitle
source: Vet2U
ar: فط2ي

source: Welcome back,
ar: مرحبا بعودتك,

# yourPetsSafeHands
source: Your pets are in safe hands
ar: حيواناتك الأليفة في أيدٍ آمنة

source: Overview
ar: نظرة عامة

# quickSnapshot
source: Quick snapshot of your pets & visits
ar: لقطة سريعة لحيواناتك الأليفة وزياراتك

source: Active Pets
ar: الحيوانات الأليفة النشطة

source: Upcoming
ar: قادمة

source: Quick Actions
ar: الإجراءات السريعة

# jumpToTasks
source: Jump directly to the most common tasks
ar: الانتقال مباشرة إلى المهام الأكثر شيوعًا

# scheduleVetCare
source: Schedule veterinary care
ar: جدولة العناية البيطرية

source: Manage pet profiles
ar: إدارة ملفات الحيوانات الأليفة

# followVetVisit
source: Follow your vet visit
ar: متابعة زيارة الطبيب البيطري

source: Track Service
ar: تتبع الخدمة

source: View past treatments
ar: عرض العلاجات السابقة

# downloadTreatmentDocs
source: Download treatment documents
ar: تنزيل مستندات العلاج

source: Medical Documents
ar: الوثائق الطبية

source: Select Language
ar: اختر اللغة

source: Cancel
ar: إلغاء

source: Change Language
ar: تغيير اللغة

source: Switch to Light Mode
ar: التبديل إلى الوضع الفاتح

source: Switch to Dark Mode
ar: التبديل إلى الوضع الداكن

source: Notifications
ar: التنبيهات

source: Emergency Request
ar: طلب طارئ

# selectPetNeedingCare
source: Select the pet needing emergency care:
ar: اختر الحيوان الأليف الذي يحتاج إلى العناية:

# choosePet
source: Choose a pet
ar: اختر حيوان أليف

# describeEmergency
source: Describe the emergency:
ar: وصف الطوارئ:

# describeSymptoms
source: Describe symptoms, injuries, or urgent situation...
ar: وصف الأعراض أو الإصابات أو الوضع الطارئ...

# shareLocationResponders
source: Share my current location with emergency responders
ar: مشاركة موقعي الحالي مع مستجيبي الطوارئ

# emergencyWarning
source: Emergency services will be dispatched immediately. This is for life-threatening situations only.
ar: سيتم إرسال خدمات الطوارئ فورًا. هذا للحالات التي تهدد الحياة فقط.

source: Send Emergency Request
ar: إرسال طلب طارئ

# pleaseSelectPet
source: Please select a pet
ar: يرجى اختيار حيوان أليف

# pleaseDescribeEmergency
source: Please describe the emergency
ar: يرجى وصف الطوارئ

# emergencyRequestSent
source: Emergency request sent! Help is on the way.
ar: تم إرسال طلب الطوارئ! المساعدة في الطريق.

# failedSendEmergency
source: Failed to send emergency request
ar: فشل في إرسال طلب الطوارئ

source: Medical History
ar: التاريخ الطبي

# noMedicalRecords
source: No medical records found
ar: لا توجد سجلات طبية

source: Diagnosis
ar: التشخيص

source: Treatment
ar: العلاج

source: Prescription
ar: الوصفات الطبية

source: Notes
ar: الملاحظات

source: Profile
ar: الملف الشخصي

source: Personal Information
ar: المعلومات الشخصية

# updateDetails
source: Update your details
ar: تحديث التفاصيل

source: Contact number
ar: رقم الاتصال

source: Account Settings
ar: إعدادات الحساب

source: Notifications, privacy
ar: التنبيهات، الخصوصية

source: Settings coming soon
ar: الإعدادات قادمة قريبًا

source: Select Driver
ar: اختر السائق

source: Close App
ar: إغلاق التطبيق

source: Service for Today
ar: الخدمة اليوم

# notificationsAndReminders
source: Notifications & Reminders
ar: التنبيهات والتذكيرات

# receiveReminders
source: Receive reminders for vaccinations, checkups, follow-ups, and mobile clinic arrivals
ar: استقبال التذكيرات للتلقيحات والفحوصات والمتابعات ووصول العيادات المتنقلة

source: Sign Out
ar: تسجيل الخروج

# pleaseAddPetFirst
source: Please add a pet first
ar: يرجى إضافة حيوان أليف أولاً

source: Emergency
ar: طوارئ

source: Home
ar: الرئيسية

source: Pets
ar: الحيوانات الأليفة

source: Book
ar: حجز

source: Appointments
ar: المواعيد

source: Treatments
ar: العلاجات

source: Inventory
ar: المخزون

source: Book Appointment
ar: احجز موعد

# scheduleVisit
source: Schedule a Visit
ar: جدولة زيارة

# bookVetCare
source: Book veterinary care for your pet
ar: احجز رعاية بيطرية لحيوانك الأليف

source: Select Date
ar: اختر التاريخ

source: Select Time
ar: اختر الوقت

source: Select Service
ar: اختر الخدمة

# chooseService
source: Choose a service
ar: اختر خدمة

source: Select Doctor
ar: اختر الطبيب

# chooseDoctor
source: Choose a doctor
ar: اختر طبيب

source: Select Pet
ar: اختر الحيوان الأليف

source: Urgency Level
ar: مستوى الإلحاح

source: Appointment Location *
ar: موقع الموعد *

# locationDescription
source: Select the location where the vet service will be provided. This helps the driver navigate to your location.
ar: اختر الموقع الذي سيتم تقديم الخدمة البيطرية فيه. هذا يساعد السائق في التنقل إلى موقعك.

# clickMapIcon
source: Click the map icon to select location *
ar: انقر على أيقونة الخريطة لاختيار الموقع *

source: Selected Location
ar: الموقع المحدد

# locationRequired
source: Location is required for the driver to find you
ar: الموقع مطلوب لكي يتمكن السائق من العثور عليك

source: Description (Optional)
ar: الوصف (اختياري)

# bookAppointmentButton
source: Book Appointment
ar: حجز الموعد

# pleaseSelectServiceTimePetDoctor
source: Please select service, time, pet, and doctor
ar: يرجى اختيار الخدمة والوقت والحيوان الأليف والطبيب

# pleaseSelectLocation
source: Please select a location for the appointment
ar: يرجى اختيار موقع للموعد

source: Please login first
ar: يرجى تسجيل الدخول أولاً

source: Appointment booked successfully!
ar: تم حجز الموعد بنجاح!

source: Failed to book appointment
ar: فشل في حجز الموعد

source: Routine
ar: روتيني

source: Urgent
ar: عاجل

source: Share current location
ar: مشاركة الموقع الحالي

source: Get current location
ar: الحصول على الموقع الحالي

source: Change
ar: تغيير

source: No doctors available
ar: لا يوجد أطباء متاحون

source: Dr.
ar: د.

source: Today
ar: اليوم

source: Tomorrow
ar: غداً

source: at
ar: في

source: Emergency response started
ar: تم بدء الاستجابة للطوارئ

source: Failed to start emergency response
ar: فشل في بدء الاستجابة للطوارئ

source: Emergency case completed
ar: تم إكمال حالة الطوارئ

source: Failed to complete emergency case
ar: فشل في إكمال حالة الطوارئ

source: Emergency Cases
ar: حالات الطوارئ

# emergencyText
source: EMERGENCY
ar: طوارئ

source: Pet ID
ar: معرف الحيوان الأليف

# caseStatus
source: Case
ar: الحالة

source: Start Response
ar: بدء الاستجابة

source: Complete
ar: إكمال

source: Error loading users
ar: خطأ في تحميل المستخدمين

# userAlreadyHasRole
source: User already has this role
ar: المستخدم لديه بالفعل هذا الدور

source: Confirm Role Change
ar: تأكيد تغيير الدور

source: Confirm
ar: تأكيد

# userRoleUpdated
source: User role updated to
ar: تم تحديث دور المستخدم إلى

source: Error updating role
ar: خطأ في تحديث الدور

# cannotDeleteOwnAccount
source: Cannot delete your own account
ar: لا يمكن حذف حسابك الخاص

source: Delete User
ar: حذف المستخدم

# areYouSureDelete
source: Are you sure you want to delete
ar: هل أنت متأكد من أنك تريد حذف

source: has been deleted
ar: تم حذفه

source: Error deleting user
ar: خطأ في حذف المستخدم

source: Link Doctor to Driver
ar: ربط الطبيب بالسائق

source: Could not launch Google Maps
ar: تعذر تشغيل خرائط جوجل

source: Could not open Google Maps
ar: تعذر فتح خرائط جوجل

source: Navigation
ar: التنقل

source: Select Location
ar: اختر الموقع

source: Use Current Location
ar: استخدم الموقع الحالي

source: Confirm Location
ar: تأكيد الموقع

source: View in Google Maps
ar: عرض في خرائط جوجل

source: Select your role
ar: اختر دورك

# cannotDeleteDoctorWithActiveLink
source: Cannot delete doctor with active driver link. Unlink first.
ar: لا يمكن حذف الطبيب بربط سائق نشط. أزل الربط أولاً.

# cannotDeleteDriverWithActiveLink
source: Cannot delete driver with active doctor link. Unlink first.
ar: لا يمكن حذف السائق بربط طبيب نشط. أزل الربط أولاً.

# permanentDeleteWarning
source: This will permanently remove the user and cannot be undone.
ar: سيؤدي هذا إلى إزالة المستخدم نهائياً ولا يمكن التراجع عنه.

source: Delete
ar: حذف

# noAvailableDriversInArea
source: No available drivers in the same area
ar: لا يوجد سائقون متاحون في نفس المنطقة

# welcomeUser
source: Welcome,
ar: مرحباً،

# selectRoleToContinue
source: Please select your role to continue:
ar: يرجى اختر دورك للمتابعة:

source: Service Area
ar: منطقة الخدمة

# serviceAreaRequired
source: Service Area *
ar: منطقة الخدمة *

# selectServiceArea
source: Select your service area
ar: اختر منطقة خدمتك

# continueButton
source: Continue
ar: متابعة

source: Profile updated successfully
ar: تم تحديث الملف الشخصي بنجاح

source: Doctor Profile
ar: ملف الطبيب

source: Edit Doctor Profile
ar: تحرير ملف الطبيب

source: Create Account
ar: إنشاء حساب

source: Let's set up your account
ar: دعنا نعد حسابك

source: Full Name
ar: الاسم الكامل

source: Enter your full name
ar: أدخل اسمك الكامل

source: Email Address
ar: عنوان البريد الإلكتروني

source: Enter your email
ar: أدخل بريدك الإلكتروني

source: Password
ar: كلمة المرور

source: Min 6 characters
ar: حد أدنى 6 أحرف

source: Phone Number
ar: رقم الهاتف

source: Optional
ar: اختياري

source: Role
ar: الدور

source: Pet Owner
ar: مالك حيوان أليف

source: Veterinarian
ar: طبيب بيطري

source: Driver
ar: سائق

source: Administrator
ar: مدير

source: Select your service area
ar: اختر منطقة خدمتك

# pleaseSelectServiceArea
source: Please select a service area
ar: يرجى اختيار منطقة خدمة

source: Or continue with
ar: أو تابع باستخدام

source: Google
ar: جوجل

source: Facebook
ar: فيسبوك

# alreadyHaveAccount
source: Already have an account?
ar: لديك حساب بالفعل؟

source: Sign In
ar: تسجيل الدخول

source: Please enter your full name
ar: يرجى إدخال اسمك الكامل

source: Please enter your email
ar: يرجى إدخال بريدك الإلكتروني

# pleaseEnterValidEmailAddress
source: Please enter a valid email address
ar: يرجى إدخال عنوان بريد إلكتروني صالح

# passwordMustBeAtLeast6Characters
source: Password must be at least 6 characters long
ar: يجب أن تكون كلمة المرور 6 أحرف على الأقل

# pleaseSelectServiceAreaForYourRole
source: Please select a service area for your role
ar: يرجى اختيار منطقة خدمة لدورك

source: Welcome back to Vet2U
ar: مرحباً بعودتك إلى فيت تو يو

source: Enter your password
ar: أدخل كلمة المرور

# dontHaveAccount
source: Don't have an account?
ar: ليس لديك حساب؟

source: Sign Up
ar: إنشاء حساب

source: Please enter your password
ar: يرجى إدخال كلمة المرور

# selectAreaWhereYouWillProvideServices
source: Select the area where you will provide services:
ar: اختر المنطقة التي ستقدم فيها الخدمات:

source: Please select species
ar: يرجى اختيار النوع

source: Please enter pet name
ar: يرجى إدخال اسم الحيوان الأليف

source: No doctors available at the moment. Please check back later.
ar: لا يوجد أطباء متاحون في الوقت الحالي. يرجى التحقق لاحقاً.

source: Available Teams
ar: الفرق المتاحة

source: doctor(s) available for home visits
ar: طبيب(أطباء) متاحون للزيارات المنزلية

source: Payment Method
ar: طريقة الدفع

source: Choose how you would like to pay for this appointment
ar: اختر كيف تريد الدفع لهذا الموعد

source: Pay Online
ar: الدفع عبر الإنترنت

source: Secure payment with card
ar: دفع آمن بالبطاقة

source: Pay on Arrival
ar: الدفع عند الوصول

source: Pay cash when service is provided
ar: الدفع نقداً عند تقديم الخدمة

source: Please capture your location
ar: يرجى التقاط موقعك

source: Vet2U Dashboard
ar: لوحة تحكم فيت تو يو

source: Book a visit
ar: احجز زيارة

source: Add your first pet
ar: أضف حيوانك الأليف الأول

source: Add Pet
ar: إضافة حيوان أليف

source: Services
ar: الخدمات

source: Failed to send emergency request
ar: فشل في إرسال طلب الطوارئ

source: My Pets
ar: حيواناتي الأليفة

source: No pets registered yet
ar: لم يتم تسجيل أي حيوانات أليفة بعد

# addYourPetsToBookAppointments
source: Add your pets to book appointments and manage their care
ar: أضف حيواناتك الأليفة لحجز المواعيد وإدارة رعايتها

# addYourFirstPetButton
source: Add Your First Pet
ar: أضف حيوانك الأليف الأول

# addPetButton
source: Add Pet
ar: أضف حيوان أليف

source: Loading your dashboard...
ar: جارٍ تحميل لوحة التحكم الخاصة بك...

# usingDefaultLocation
source: Using default location. You can still select a location on the map.
ar: استخدام الموقع الافتراضي. يمكنك الآن تحديد موقع على الخريطة.

source: Error getting current location
ar: خطأ في الحصول على الموقع الحالي: {error}

source: Start Navigation
ar: ابدأ التنقل

source: Tap on the map to select a location
ar: اضغط على الخريطة لتحديد موقع

source: Complete Payment
ar: إكمال الدفع

source: Payment Summary
ar: ملخص الدفع

source: Card Details
ar: تفاصيل البطاقة

# youWillPayInCash
source: You will pay in cash when the service is delivered.
ar: ستدفع نقداً عند تقديم الخدمة.

source: Your payment information is secure
ar: معلومات الدفع الخاصة بك آمنة

source: Payment failed. Please try again.
ar: فشل الدفع. يرجى المحاولة مرة أخرى.

# paymentError
source: Payment error: {error}
ar: خطأ في الدفع: {error}

source: Payment History
ar: تاريخ الدفع

source: INVOICE
ar: الفاتورة

source: Status
ar: الحالة

source: Service Details
ar: تفاصيل الخدمة

source: Payment Breakdown
ar: تفصيل الدفع

source: Payment Information
ar: معلومات الدفع

source: Download Invoice
ar: تحميل الفاتورة

source: Request Refund
ar: طلب استرداد

source: Retry Payment
ar: إعادة محاولة الدفع

source: Contact Support
ar: اتصل بالدعم

source: Invoice downloaded successfully
ar: تم تحميل الفاتورة بنجاح

# failedToDownloadInvoice
source: Failed to download invoice: {error}
ar: فشل في تحميل الفاتورة: {error}

# requestRefundTitle
source: Request Refund
ar: طلب استرداد

# areYouSureYouWantToRequestARefund
source: Are you sure you want to request a refund for this payment?
ar: هل أنت متأكد من أنك تريد طلب استرداد لهذا الدفع؟

# requestRefundButton
source: Request Refund
ar: طلب استرداد

# supportContactFeatureComingSoon
source: Support contact feature coming soon. Please call our support line.
ar: ميزة الاتصال بالدعم قادمة قريباً. يرجى الاتصال بخط الدعم لدينا.

source: My Appointments
ar: مواعيدي

source: Past
ar: الماضية

source: No appointments
ar: لا توجد مواعيد

source: No upcoming appointments
ar: لا توجد مواعيد قادمة

source: No past appointments
ar: لا توجد مواعيد ماضية

source: Cancel Appointment
ar: إلغاء الموعد

source: Are you sure you want to cancel this appointment?
ar: هل أنت متأكد من أنك تريد إلغاء هذا الموعد؟

source: No
ar: لا

source: Yes, Cancel
ar: نعم، إلغاء

source: Confirm Appointment
ar: تأكيد الموعد

# areYouSureYouWantToConfirmThisAppointment
source: Are you sure you want to confirm this appointment? It will be added to your calendar after payment.
ar: هل أنت متأكد من أنك تريد تأكيد هذا الموعد؟ سيتم إضافته إلى التقويم بعد الدفع.

source: Yes, Confirm
ar: نعم، تأكيد

source: Appointment cancelled
ar: تم إلغاء الموعد

source: Appointment confirmed
ar: تم تأكيد الموعد

source: Appointments refreshed
ar: تم تحديث المواعيد

source: Description
ar: الوصف

source: Price
ar: السعر

source: Add to Calendar
ar: إضافة إلى التقويم

source: Synced to Calendar
ar: تم المزامنة مع التقويم

source: Enable Notifications
ar: تفعيل الإشعارات

source: Receive reminders and updates
ar: تلقي التذكيرات والتحديثات

source: Reminder Types
ar: أنواع التذكيرات

source: Vaccination Reminders
ar: تذكيرات التطعيم

source: Get reminded about upcoming vaccinations
ar: احصل على تذكير بالتطعيمات القادمة

source: Checkup Reminders
ar: تذكيرات الفحص

source: Reminders for scheduled veterinary checkups
ar: تذكيرات بالفحوصات البيطرية المجدولة

source: Follow-up Reminders
ar: تذكيرات المتابعة

source: Reminders for follow-up appointments
ar: تذكيرات بمواعيد المتابعة

source: Appointment Reminders
ar: تذكيرات المواعيد

source: Get notified before your appointments
ar: احصل على إشعار قبل مواعيدك

source: Mobile Clinic Alerts
ar: تنبيهات العيادة المتنقلة

source: Notifications when mobile clinics are arriving
ar: إشعارات عند وصول العيادات المتنقلة

source: Send Test Notification
ar: إرسال إشعار تجريبي

source: Test notification sent!
ar: تم إرسال الإشعار التجريبي!

# testNotificationsHelpYouVerify
source: Test notifications help you verify that your notification settings are working correctly.
ar: يساعدك الإشعارات التجريبية في التحقق من أن إعدادات الإشعارات تعمل بشكل صحيح.

source: Vet2U
ar: فيت تو يو

source: Your Pet's Health Companion
ar: رفيق صحة حيوانك الأليف

source: Loading...
ar: جارٍ التحميل...

source: Track Drivers
ar: تتبع السائقين

source: Select District
ar: اختر المنطقة

source: All Specialties
ar: جميع التخصصات

source: General Practice
ar: الممارسة العامة

source: Surgery
ar: الجراحة

source: Dermatology
ar: الأمراض الجلدية

source: Available Only
ar: المتاحون فقط

source: Document downloaded successfully
ar: تم تحميل الوثيقة بنجاح

source: Failed to download document
ar: فشل في تحميل الوثيقة: {error}

# errorDownloadingDocument
source: Error downloading document: {error}
ar: خطأ في تحميل الوثيقة: {error}

source: Document History
ar: تاريخ الوثيقة

source: Close
ar: إغلاق

source: Filter by pet (optional)
ar: تصفية حسب الحيوان الأليف (اختياري)

source: All pets
ar: جميع الحيوانات الأليفة

source: Uploaded
ar: تم الرفع

source: Download
ar: تحميل

source: View History
ar: عرض التاريخ

source: Driver Profile
ar: ملف السائق

source: Edit Driver Profile
ar: تحرير ملف السائق

source: Update your professional information
ar: حدث معلوماتك المهنية

source: Profile picture upload coming soon
ar: رفع صورة الملف الشخصي قادم قريباً

source: Change Photo
ar: تغيير الصورة

source: Professional Information
ar: المعلومات المهنية

source: Change Password
ar: تغيير كلمة المرور

source: Enable to change your password
ar: تفعيل لتغيير كلمة المرور

# yourProfileInformationHelpsUs
source: Your profile information helps us contact you and secure your account.
ar: تساعدنا معلومات ملفك الشخصي في الاتصال بك وتأمين حسابك.

source: My Profile
ar: ملفي الشخصي

source: Edit Profile
ar: تحرير الملف الشخصي

source: Update your personal information
ar: حدث معلوماتك الشخصية

source: Push Notifications
ar: الإشعارات الفورية

source: Receive appointment reminders and updates
ar: تلقي تذكيرات المواعيد والتحديثات

source: Language
ar: اللغة

source: Biometric Login
ar: تسجيل الدخول البيومتري

source: Use fingerprint or face unlock
ar: استخدم بصمة الإصبع أو فتح الوجه

source: Dark Mode
ar: الوضع المظلم

source: Switch between light and dark themes
ar: التبديل بين السمات الفاتحة والمظلمة

source: Notification Preferences
ar: تفضيلات الإشعارات

source: Manage reminders and alerts
ar: إدارة التذكيرات والتنبيهات

source: Logout
ar: تسجيل الخروج

source: Are you sure you want to logout?
ar: هل أنت متأكد من أنك تريد تسجيل الخروج؟

source: Data export feature coming soon
ar: ميزة تصدير البيانات قادمة قريباً

source: Export My Data
ar: تصدير بياناتي

source: Account deletion feature coming soon
ar: ميزة حذف الحساب قادمة قريباً

source: Delete Account
ar: حذف الحساب

source: Error picking image
ar: خطأ في اختيار الصورة

source: Choose Image Source
ar: اختر مصدر الصورة

source: Camera
ar: الكاميرا

source: Gallery
ar: المعرض

source: Delete Pet
ar: حذف الحيوان الأليف

source: Are you sure you want to delete
ar: هل أنت متأكد من أنك تريد حذف

# petDeletedSuccessfully
source: deleted successfully
ar: تم الحذف بنجاح

source: Edit Pet
ar: تحرير الحيوان الأليف

source: Species
ar: النوع

source: Pet Name
ar: اسم الحيوان الأليف

source: Breed (Optional)
ar: السلالة (اختياري)

source: Date of Birth (Optional)
ar: تاريخ الميلاد (اختياري)

source: Notes (Optional)
ar: الملاحظات (اختياري)

source: Medical History Summary (Optional)
ar: ملخص التاريخ الطبي (اختياري)

source: User not authenticated
ar: المستخدم غير مصدق

source: Pet added successfully
ar: تم إضافة الحيوان الأليف بنجاح

source: Pet updated successfully
ar: تم تحديث الحيوان الأليف بنجاح

source: Add
ar: إضافة

source: Update
ar: تحديث

source: pet(s) registered
ar: حيوان(حيوانات) مسجل

source: Tap a pet to view or update its details
ar: اضغط على حيوان أليف لعرض أو تحديث تفاصيله

source: Edit
ar: تحرير

source: Medical
ar: طبي

source: ID
ar: المعرف

source: Access Denied
ar: تم رفض الوصول

# youMustBeLinkedToADoctor
source: You must be linked to a doctor before assigning a van
ar: يجب أن تكون مرتبطاً بطبيب قبل تخصيص فان

source: Successfully assigned van
ar: تم تخصيص الفان بنجاح

source: Failed to assign van
ar: فشل في تخصيص الفان

source: Van unassigned successfully
ar: تم إلغاء تخصيص الفان بنجاح

source: Failed to unassign van
ar: فشل في إلغاء تخصيص الفان

source: Select Van
ar: اختر الفان

source: Currently Assigned Van
ar: الفان المخصص حالياً

source: License
ar: الرخصة

source: Model
ar: الموديل

source: Capacity
ar: السعة

source: passenger(s)
ar: راكب(ركاب)

source: Available Vans
ar: الفانات المتاحة

source: No vans available for assignment
ar: لا توجد فانات متاحة للتخصيص

source: Assign
ar: تخصيص

source: All Vans
ar: جميع الفانات

source: Assigned to you
ar: مخصص لك

source: Assigned to another driver
ar: مخصص لسائق آخر

source: Unassign
ar: إلغاء التخصيص

source: No emergency cases assigned
ar: لا توجد حالات طوارئ مخصصة

# emergencyCasesWillAppearHere
source: Emergency cases will appear here when assigned
ar: ستظهر حالات الطوارئ هنا عند التخصيص

source: Medical Visit
ar: الزيارة الطبية

source: No Pets Found
ar: لم يتم العثور على حيوانات أليفة

# needToAddPetBeforeBooking
source: You need to add at least one pet before booking an appointment. Would you like to add a pet now?
ar: تحتاج إلى إضافة حيوان أليف واحد على الأقل قبل حجز موعد. هل تريد إضافة حيوان أليف الآن؟

source: Get Started!
ar: ابدأ!

# addPetProfileToBook
source: Add your pet profile to start booking veterinary services.
ar: أضف ملف حيوانك الأليف لبدء حجز الخدمات البيطرية.

source: Ready to Book?
ar: جاهز للحجز؟

# scheduleVetVisitForPet
source: Schedule a veterinary visit for your pet.
ar: جدول زيارة بيطرية لحيوانك الأليف.

source: Our Services
ar: خدماتنا

source: Booking
ar: الحجز

source: Schedule a Visit
ar: جدول زيارة

source: Records
ar: السجلات

source: Health Records
ar: سجلات الصحة

source: Immediate Care
ar: الرعاية الفورية

source: Payments
ar: المدفوعات

source: Manage Payments
ar: إدارة المدفوعات

source: Coming soon!
ar: قادم قريباً!

source: Emergency services coming soon!
ar: خدمات الطوارئ قادمة قريباً!

source: Payment management coming soon!
ar: إدارة المدفوعات قادمة قريباً!

source: Pet Registered
ar: حيوان أليف مسجل

source: No Pets Yet
ar: لا توجد حيوانات أليفة بعد

source: Prescriptions, lab results, and more
ar: الوصفات الطبية، نتائج المختبرات، والمزيد

source: No medical documents found
ar: لم يتم العثور على وثائق طبية

# documentsUploadedByDoctorWillAppearHere
source: Documents uploaded by your doctor will appear here
ar: ستظهر هنا الوثائق التي يرفعها طبيبك

# uploadedLabel
source: Uploaded:
ar: تم الرفع:

source: Error linking users
ar: خطأ في ربط المستخدمين: {error}

source: Assign Van to Team
ar: تعيين فان للفريق

source: Cancel Linking
ar: إلغاء الربط

# errorAssigningVan
source: Error assigning van: {error}
ar: خطأ في تخصيص الفان: {error}

source: Linking cancelled - no van assigned
ar: تم إلغاء الربط - لم يتم تعيين فان

# unlinkedFrom
source: Unlinked {doctorName} from {driverName}
ar: تم إلغاء ربط {doctorName} من {driverName}

source: Error unlinking users
ar: خطأ في إلغاء ربط المستخدمين: {error}

source: Add New User
ar: إضافة مستخدم جديد

source: Owner
ar: مالك

source: Doctor
ar: طبيب

source: Admin
ar: مدير

# nameRequired
source: Name is required
ar: الاسم مطلوب

# emailRequired
source: Email is required
ar: البريد الإلكتروني مطلوب

# enterValidEmail
source: Please enter a valid email
ar: يرجى إدخال بريد إلكتروني صحيح

# passwordRequired
source: Password is required
ar: كلمة المرور مطلوبة

# passwordMinLength
source: Password must be at least 6 characters
ar: يجب أن تكون كلمة المرور 6 أحرف على الأقل

# areaRequiredForDoctorsDrivers
source: Area is required for doctors and drivers
ar: المنطقة مطلوبة للأطباء والسائقين

source: Error
ar: خطأ: {error}

# confirmLogout
source: Are you sure you want to logout?
ar: هل أنت متأكد من أنك تريد تسجيل الخروج؟

source: Error logging out
ar: خطأ في تسجيل الخروج: {error}

source: Save Changes
ar: حفظ التغييرات

source: Veterinary Services
ar: الخدمات البيطرية
